<?php

/**

 * Created by PhpStorm.

 * User: Administrator

 * Date: 2019/3/29 0029

 * Time: 下午 1:01

 */



namespace app\rebirth\controller;





class Enum

{

    /*

     * 健身房月卡/赠卡价格

     */

    public static function charge(){

        return array(
            //单日卡
            'day'=>[

                'price'=>66,

                'time'=>60*60*24,

                'desc'=>'购买日卡'

            ],
            //周买卡
            'week'=>[

                'price'=>99,

                'time'=>60*60*24*7,

                'desc'=>'购买周卡'

            ],
            //月买卡
            'month'=>[

                'price'=>1200,

                'time'=>60*60*24*30,

                'desc'=>'购买月卡'

            ],
            //季买卡
            'season'=>[

                //'price'=>999,
                'price'=>3168,
                'time'=>60*60*24*90,

                'desc'=>'购买季卡'

            ],
            //年买卡
            'year'=>[

                //'price'=>3588,
                'price'=>10080,
                'time'=>60*60*24*360,

                'desc'=>'购买年卡'

            ],
 //单次卡
            'time'=>[

                //'price'=>59,
                'price'=>120,
                'time'=>0,

                'desc'=>'购买次卡'

            ],
 //10次卡
            'xun'=>[

                //'price'=>490,
                'price'=>1200,
                'time'=>0,
                'desc'=>'购买十次卡'
            ],
 //百次卡
            'hundred'=>[

                'price'=>12000,

                'time'=>0,

                'desc'=>'购买百次卡'

            ],

        );
    }



    /*

 * 柜子充值

 */

    public static function locker_charge(){

        return array(

            'month'=>1,

            'season'=>297,

            'year'=>1188,

        );





    }



    /*
     * 柜子=楷林IFC店
     * 设备编号：1100010614=总计49个柜子
     */

    public static function locker_command(){

        return array(

            1=>'0101',

            2=>'0102',

            3=>'0103',

            4=>'0104',

            5=>'0105',

            6=>'0106',

            7=>'0107',

            8=>'0108',

            9=>'0109',

            10=>'010a',

            11=>'010b',

            12=>'010c',

            13=>'0201',

            14=>'0202',

            15=>'0203',

            16=>'0204',

            17=>'0205',

            18=>'0206',

            19=>'0207',

            20=>'0208',

            21=>'0209',

            22=>'0301',

            23=>'0302',

            24=>'0303',

            25=>'0304',

            26=>'0305',

            27=>'0306',

            28=>'0307',

            29=>'0308',

            30=>'0309',

            31=>'030a',

            32=>'030b',

            33=>'030c',

            34=>'0401',

            35=>'0402',

            36=>'0501',

            37=>'0502',

            38=>'0503',

            39=>'0504',

            40=>'0505',

            41=>'0506',

            42=>'0507',

            43=>'0508',

            44=>'0509',

            45=>'050a',

            46=>'050b',

            47=>'050c',

            48=>'0601',

            49=>'0602',

        );



    }

    /*
     * 柜子=人保大厦店
     * 1-16：1100011403
     * 17-40：1100011413
     *
     */
    public static function locker_command2(){

        return array(
            1 =>'0101',
            2 =>'0102',
            3 =>'0103',
            4 =>'0104',
            5 =>'0105',
            6 =>'0106',
            7 =>'0107',
            8 =>'0108',
            9 =>'0201',
            10 =>'0202',
            11 =>'0203',
            12 =>'0204',
            13 =>'0205',
            14 =>'0206',
            15 =>'0207',
            16 =>'0208',
            17=>'0101',
            18=>'0102',
            19=>'0103',
            20=>'0104',
            21=>'0105',
            22=>'0106',
            23=>'0107',
            24=>'0108',
            25=>'0201',
            26=>'0202',
            27=>'0203',
            28=>'0204',
            29=>'0205',
            30=>'0206',
            31=>'0207',
            32=>'0208',
            33=>'0301',
            34=>'0302',
            35=>'0303',
            36=>'0304',
            37=>'0305',
            38=>'0306',
            39=>'0307',
            40=>'0308',
        );



    }

    /*
     * 楷林国际店
     * 1-16：1100011268
     * 17-40：1100011414
     *
     */

    public static function locker_command3(){
        return array(
            1 =>'0101',
            2 =>'0102',
            3 =>'0103',
            4 =>'0104',
            5 =>'0105',
            6 =>'0106',
            7 =>'0107',
            8 =>'0108',
            9 =>'0201',
            10 =>'0202',
            11 =>'0203',
            12 =>'0204',
            13 =>'0205',
            14 =>'0206',
            15 =>'0207',
            16 =>'0208',
            17=>'0101',
            18=>'0102',
            19=>'0103',
            20=>'0104',
            21=>'0105',
            22=>'0106',
            23=>'0107',
            24=>'0108',
            25=>'0201',
            26=>'0202',
            27=>'0203',
            28=>'0204',
            29=>'0205',
            30=>'0206',
            31=>'0207',
            32=>'0208',
            33=>'0301',
            34=>'0302',
            35=>'0303',
            36=>'0304',
            37=>'0305',
            38=>'0306',
            39=>'0307',
            40=>'0308',
        );
    }

    /*

     * 礼品卡

     */

    public static function gift(){

        return array(

            1=>[

                'id'=>1,

                'title'=>'感谢卡',

                'image'=>'https://xunchas.yuanfangyun.com/redcard.jpg',

                'info'=>'我们的一生中，总会遇见一些帮助我们的人。送TA一张Rebirth运动感谢卡，运动的相伴，最能表达你的协议。'

            ],

            2=>[

                'id'=>2,

                'title'=>'生日卡',

                'image'=>'https://xunchas.yuanfangyun.com/orangecard.jpg',

                'info'=>'今天是你的生日，愿所有的幸福都围绕着你。送TA一张Rebirth运动生日卡，愿你来年暴瘦暴富。'

            ],

            3=>[

                'id'=>3,

                'title'=>'闺蜜卡',

                'image'=>'https://xunchas.yuanfangyun.com/purplecard.jpg',

                'info'=>'找不找男盆友无所谓，和闺蜜一起瘦下来最重要。送TA一张Rebirth运动闺蜜卡，好好享受二人世间。'

            ],

            4=>[

                'id'=>4,

                'title'=>'商务卡',

                'image'=>'https://xunchas.yuanfangyun.com/greencard.jpg',

                'info'=>'送给追求终身成长的TA，一份拿得出手的知识礼物--Rebirth运动商务卡。再忙，也要保持运动。身体是革命的本钱。'

            ],

            5=>[

                'id'=>5,

                'title'=>'男神卡',

                'image'=>'https://xunchas.yuanfangyun.com/depbluecard.jpg',

                'info'=>'男神的性感除了来自于FACE,还来自于完美的身材。送他一张Rebirth运动男神卡，打造一枚完美腹肌男神。'

            ],

            6=>[

                'id'=>6,

                'title'=>'女神卡',

                'image'=>'https://xunchas.yuanfangyun.com/pinkcard.jpg',

                'info'=>'好看的皮囊千篇一律，有趣的灵魂百里挑一。送她一张Rebirth运动女神卡，打造一枚万里挑一的马甲线女神。'

            ],

            7=>[

                'id'=>7,

                'title'=>'情侣卡',

                'image'=>'https://xunchas.yuanfangyun.com/whitecard.jpg',

                'info'=>'全世界有几十亿人口，两个人相遇的概率仅有千万分之一。与TA在人海中相恋，是多么幸运的事。送TA一张Rebirth运动情侣卡，恋在一起，练在一起。'

            ],

            8=>[

                'id'=>8,

                'title'=>'经典卡',

                'image'=>'https://xunchas.yuanfangyun.com/yellowcard.jpg',

                'info'=>'运动是生命的滋润剂，健身是青春的美容师。那些我们生命中重要的人，也许正等待一场改变，一场重生。送TA一张Rebirth运动经典卡，帮助TA们改变自己，也表达你的心意。'

            ],

        );





    }



//    /*

//     * 次卡相关

//     */

//    public static function once(){

//        return array(

//            'price'=>56

//        );

//    }



}